# Assignment: Preparing Data for Analysis (Modified Titanic)

![](https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/%20files/hw.png)

In [1]:
#Import the libraries
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('https://github.com/stepboom/mitsubishi-course-2023/raw/main/data/titanic_training_dataset_v2.csv')

In [64]:
df2 = pd.read_csv('https://github.com/stepboom/mitsubishi-course-2023/raw/main/data/titanic_training_dataset_v2.csv')

In [65]:
df2.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,865.000000,828.000000,714.000000,858.000000,891.000000,891.000000
mean,446.000000,0.383815,2.304348,29.699118,0.524476,0.381594,32.204208
std,257.353842,0.486595,0.836952,14.526497,1.115284,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     865 non-null    float64
 2   Pclass       828 non-null    float64
 3   Name         866 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        858 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       852 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     803 non-null    object
dtypes: float64(5), int64(2), object(5)
memory usage: 83.7+ KB

# 1) Load data & review the data

<font color='blue'>Q1) What is the shape of this dataset? (rows & columns)</font>

In [5]:
df.shape

(891, 12)

# 2) Drop unqualified variables

*   Drop variables with missing > 50%
*   Drop categorical variables with flat values > 70% (variables with the same value in the same column)

<font color='blue'>Q2) How many columns do we have left?</font>

In [7]:
df.isnull().sum()

PassengerId      0
Survived        26
Pclass          63
Name            25
Sex              0
Age            177
SibSp           33
Parch            0
Ticket          39
Fare             0
Cabin          687
Embarked        88
dtype: int64

In [11]:
half_count = len(df) / 2
df.dropna(thresh=half_count,axis=1,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     865 non-null    float64
 2   Pclass       828 non-null    float64
 3   Name         866 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        858 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       852 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     803 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 76.7+ KB

In [13]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           866
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         653
Fare           248
Embarked         3
dtype: int64

In [19]:
df['Embarked'].value_counts()

S    580
C    154
Q     69
Name: Embarked, dtype: int64

In [20]:
len(df) * 0.7

623.6999999999999

# 3) Remove all rows with missing target (the variable "Survived")

<font color='blue'>Q3) How many rows do we have left?</font>

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     865 non-null    float64
 2   Pclass       828 non-null    float64
 3   Name         866 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        858 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       852 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     803 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 76.7+ KB

In [22]:
df.dropna(subset=["Survived"], axis=0, inplace=True)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 865 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  865 non-null    int64
 1   Survived     865 non-null    float64
 2   Pclass       802 non-null    float64
 3   Name         840 non-null    object
 4   Sex          865 non-null    object
 5   Age          693 non-null    float64
 6   SibSp        832 non-null    float64
 7   Parch        865 non-null    int64
 8   Ticket       826 non-null    object
 9   Fare         865 non-null    float64
 10  Embarked     778 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 81.1+ KB

# 4) Handle outliers 

For the variable “Fare”, replace outlier values with the boundary values


*   If value < (Q1 - 1.5IQR), relace with (Q1 - 1.5IQR)
*   If value > (Q3 + 1.5IQR), relace with (Q3 + 1.5IQR)

<font color='blue'>Q4) What is the mean of “Fare” after replacing the outliers (round 2 decimal points)?</font>

In [24]:
df.nunique()

PassengerId    865
Survived         2
Pclass           3
Name           840
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         637
Fare           245
Embarked         3
dtype: int64

In [59]:
num_col = ['Fare']
Q1 = df[ num_col ].quantile(0.25)
print(Q1)
Q3 = df[ num_col ].quantile(0.75)
print(Q3)
IQR = Q3 - Q1
print(IQR)

lower_bound = float(Q1 - 1.5*IQR)
upper_bound = float(Q3 + 1.5*IQR)
print(lower_bound, upper_bound)

Fare    7.8958
Name: 0.25, dtype: float64
Fare    31.0
Name: 0.75, dtype: float64
Fare    23.1042
dtype: float64
-26.7605 65.6563

In [44]:
df['Fare'].describe()

count    865.000000
mean      32.392398
std       50.250286
min        0.000000
25%        7.895800
50%       14.458300
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [60]:
def replace_upper(fare):
  if fare > upper_bound:
    return upper_bound
  else:
    return fare

In [62]:
df["Fare"] = df["Fare"].apply(replace_upper)

In [63]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,865.000000,865.000000,802.000000,693.000000,832.000000,865.000000,865.000000
mean,457.226590,0.383815,2.298005,29.892266,0.514423,0.380347,24.038997
std,252.780939,0.486595,0.838952,14.594784,1.096887,0.806417,20.477911
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,243.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,459.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.458300
75%,675.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,65.656300

# 5) Impute missing value



*   Show the number of missing values in each variable
*   Impute missing values with mean & mode
*   Show the number of missing values again after missing value imputation

<font color='blue'>Q5) Which variable has the largest number of missing values?</font>

In [66]:
imputable_mode = ['Pclass', 'SibSp', 'Parch', 'Ticket']
imputable_mean = ['Age', 'Fare']

In [67]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass          63
Name            25
Sex              0
Age            172
SibSp           33
Parch            0
Ticket          39
Fare             0
Embarked        87
dtype: int64

In [75]:
replace_values = {}
replace_values['Pclass'] = df['Pclass'].mode()[0]
replace_values['SibSp'] = df['SibSp'].mode()[0]
replace_values['Embarked'] = df['SibSp'].mode()[0]

replace_values['Age'] = round(df['Age'].mean())
replace_values

{'Pclass': 3.0, 'SibSp': 0.0, 'Embarked': 0.0, 'Age': 30}

In [76]:
df.fillna(value=replace_values, inplace=True)
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name           25
Sex             0
Age             0
SibSp           0
Parch           0
Ticket         39
Fare            0
Embarked        0
dtype: int64

# 6) Convert categorical to numeric values



*   Drop the variables “Name” & “Ticket”
*   For the variables “Sex” & “Embarked”, perform the dummy coding and drop the first level. Also, drop those original variables (“Sex” & “Embarked”)

<font color='blue'>Q6) How many columns do we have?</font>

In [78]:
df.drop(["PassengerId", "Name", "Ticket"], axis=1, inplace=True)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 865 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  865 non-null    float64
 1   Pclass    865 non-null    float64
 2   Sex       865 non-null    object
 3   Age       865 non-null    float64
 4   SibSp     865 non-null    float64
 5   Parch     865 non-null    int64
 6   Fare      865 non-null    float64
 7   Embarked  865 non-null    object
dtypes: float64(5), int64(1), object(2)
memory usage: 60.8+ KB

In [84]:
df = pd.get_dummies(df,drop_first=True, columns=["Sex", "Embarked"])

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 865 entries, 0 to 890
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    865 non-null    float64
 1   Pclass      865 non-null    float64
 2   Age         865 non-null    float64
 3   SibSp       865 non-null    float64
 4   Parch       865 non-null    int64
 5   Fare        865 non-null    float64
 6   Sex_male    865 non-null    uint8
 7   Embarked_C  865 non-null    uint8
 8   Embarked_Q  865 non-null    uint8
 9   Embarked_S  865 non-null    uint8
dtypes: float64(5), int64(1), uint8(4)
memory usage: 50.7 KB

# 7) Partition data



*   Split train/test split with stratification using 70%:30% and random seed with 12345
*   Show a proportion between survived (1) and died (0) in all data sets (total data, train, test)

<font color='blue'>Q7) What is a proportion between survived (1) and died (0) in the training data?</font>

In [86]:
from sklearn.model_selection import train_test_split

y = df["Survived"]
X = df.drop(["Survived"], axis=1)

In [94]:
X_train,X_test,y_train,y_test = train_test_split(X ,y ,stratify=y ,test_size=0.30, random_state=12345)